In [1]:
#import some necessary librairies

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
%matplotlib inline
import matplotlib.pyplot as plt  # Matlab-style plotting
import seaborn as sns
color = sns.color_palette()
sns.set_style('darkgrid')

import warnings
warnings.filterwarnings(action='ignore')

from scipy import stats
from scipy.stats import norm, skew #for some statistics


pd.set_option('display.float_format', lambda x: '{:.3f}'.format(x)) #Limiting floats output to 3 decimal points


#from subprocess import check_output
#print(check_output(["ls", "../input"]).decode("utf8")) #check the files available in the directory

In [2]:
#function to get the encoding of the FSDT files

import chardet

def find_encoding(fname):
    r_file = open(fname, 'rb').read()
    result = chardet.detect(r_file)
    charenc = result['encoding']
    return charenc

In [3]:
fsdt_1 = pd.read_csv('3rd_ppp_for_upload_win.csv', encoding = "ISO-8859-1")
fsdt_2 = pd.read_csv('atm_for_upload_win.csv', encoding = "ISO-8859-1")
fsdt_3 = pd.read_csv('banks_for_upload_win.csv', encoding = "ISO-8859-1")
fsdt_4 = pd.read_csv('bus_stands_for_upload_win.csv', encoding = "ISO-8859-1")
fsdt_5 = pd.read_csv('microfinance_for_upload_win.csv', encoding = "ISO-8859-1")
fsdt_6 = pd.read_csv('mobilemoney_agents_for_upload_win.csv', encoding = "ISO-8859-1")
fsdt_7 = pd.read_csv('pos_for_upload_win.csv', encoding = "ISO-8859-1")
fsdt_8 = pd.read_csv('post_office_for_upload_win.csv', encoding = "ISO-8859-1")
fsdt_9 = pd.read_csv('sacco_for_upload_win.csv', encoding = "ISO-8859-1")

In [4]:
fsdt_1.head(3)

,region,district,ward,latitude,longitude,agent_name,standalone_agent,other_activities,trading_hours,provider_selcom,...,services_airtime_purchase,Other than those listed above are there any other services provided?,Please indicate,branding_but__service,Please select,branding_but_no_service_MaxMalipo,branding_but_no_service_Selcom,branding_but_no_service_ButtonPay,branding_but_no_service_other,branding_but_no_service_other_detail
0,Mwanza,Magu,Nyanguge,-2.369,33.577,Ahad Techknowledge,Conduct other business,Accessories,12 hours,Yes,...,Yes,nan,nan,NaN,nan,NaN,NaN,NaN,NaN,NaN
1,Mwanza,Ilemela,Nyakato,-2.532,32.948,Dady Mpesa Shop,Conduct other business,Accessories,12 hours,NaN,...,Yes,nan,nan,NaN,nan,NaN,NaN,NaN,NaN,NaN
2,Dar es Salaam,Ilala,Segerea,-6.842,39.211,A City Shop,Stand Alone Agent,NaN,12 hours,Yes,...,Yes,nan,nan,NaN,nan,NaN,NaN,NaN,NaN,NaN

In [5]:
fsdt_3.head(3)

,region,district,ward,latitude,longitude,bank_type,bank_name,weekend_trading,yr_started,yr_started_reformatted
0,Dar es Salaam,Temeke,Mbagala,-6.922,39.271,Commercial Bank,Accessbank (Tanzania) Limited,Yes,16/05/11,2011-5-01
1,Shinyanga,Kahama,Kahama Mjini,-3.829,32.600,Commercial Bank,Accessbank (Tanzania) Limited,No,12/07/13,2013-7-01
2,Dar es Salaam,Temeke,Miburani,-6.862,39.262,Commercial Bank,Accessbank (Tanzania) Limited,Yes,05/03/98,1998-3-01

In [6]:
fsdt_1 = fsdt_1[['region', 'district', 'ward', 'latitude', 'longitude']]
fsdt_2 = fsdt_2[['region', 'district', 'ward', 'latitude', 'longitude']]
fsdt_3 = fsdt_3[['region', 'district', 'ward', 'latitude', 'longitude']]
fsdt_4 = fsdt_4[['region', 'district', 'ward', 'latitude', 'longitude']]
fsdt_5 = fsdt_5[['region', 'district', 'ward', 'latitude', 'longitude']]
fsdt_6 = fsdt_6[['region', 'district', 'ward', 'latitude', 'longitude']]
fsdt_7 = fsdt_7[['region', 'district', 'ward', 'latitude', 'longitude']]
fsdt_8 = fsdt_8[['region', 'district', 'ward', 'latitude', 'longitude']]
fsdt_9 = fsdt_9[['region', 'district', 'ward', 'latitude', 'longitude']]

In [7]:
fsdt = pd.concat([fsdt_1, fsdt_2, fsdt_3, fsdt_4, fsdt_5, fsdt_6, fsdt_7, fsdt_8, fsdt_9], axis=0)

In [8]:
fsdt.sample(7)

              region       district               ward  latitude  longitude
30293        Singida  Singida Urban            Majengo    -4.820     34.752
23786         Arusha         Arusha               Kati    -3.370     36.685
44619  Dar es Salaam      Kinondoni              Mbezi    -6.726     39.211
41365         Dodoma   Dodoma Urban             Makole    -6.177     35.758
4401   Dar es Salaam          Ilala             Kipawa    -6.853     39.209
10687  Dar es Salaam      Kinondoni           Kunduchi    -6.704     39.216
32821          Tanga        Pangani  Pangani Magharibi    -5.429     38.973

In [9]:
fsdt.shape

(56019, 5)

In [10]:
fsdt.dropna(axis=0, inplace=True)
fsdt.drop_duplicates(inplace=True)
fsdt.reset_index(drop=True, inplace=True)

In [11]:
fsdt.shape

(55850, 5)

In [12]:
fsdt.head()

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge    -2.369     33.577
1         Mwanza    Ilemela      Nyakato    -2.532     32.948
2  Dar es Salaam      Ilala      Segerea    -6.842     39.211
3  Dar es Salaam  Kinondoni  Kijitonyama    -6.779     39.241
4  Dar es Salaam     Temeke    Kigamboni    -6.828     39.310

In [13]:
fsdt.nunique()

region          22
district       124
ward          1383
latitude     40399
longitude    41000
dtype: int64

GET THE DISTRICT OF THE LONGITUDE & LATITUDE OF THE TRAINING SET AND TEST SET

In [14]:
original_fsdt = fsdt.copy()

In [15]:
fsdt['region'] = fsdt['region'].astype('category')
fsdt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55850 entries, 0 to 55849
Data columns (total 5 columns):
region       55850 non-null category
district     55850 non-null object
ward         55850 non-null object
latitude     55850 non-null float64
longitude    55850 non-null float64
dtypes: category(1), float64(2), object(2)
memory usage: 1.8+ MB

In [16]:
cat_column = fsdt.select_dtypes(include='category')

fsdt['region'] = cat_column.apply(lambda x: x.cat.codes)

In [17]:
fsdt.head()

   region   district         ward  latitude  longitude
0      13       Magu     Nyanguge    -2.369     33.577
1      13    Ilemela      Nyakato    -2.532     32.948
2       1      Ilala      Segerea    -6.842     39.211
3       1  Kinondoni  Kijitonyama    -6.779     39.241
4       1     Temeke    Kigamboni    -6.828     39.310

In [18]:
original_fsdt.head()

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge    -2.369     33.577
1         Mwanza    Ilemela      Nyakato    -2.532     32.948
2  Dar es Salaam      Ilala      Segerea    -6.842     39.211
3  Dar es Salaam  Kinondoni  Kijitonyama    -6.779     39.241
4  Dar es Salaam     Temeke    Kigamboni    -6.828     39.310

In [19]:
name_vs_label = pd.concat([original_fsdt['region'], fsdt['region']], axis=1)

In [20]:
name_vs_label.columns = ['region_name', 'region_label']

In [21]:
name_vs_label.head()

     region_name  region_label
0         Mwanza            13
1         Mwanza            13
2  Dar es Salaam             1
3  Dar es Salaam             1
4  Dar es Salaam             1

In [22]:
y = fsdt['region']
X = fsdt.drop(['ward', 'district', 'region'], axis=1)

from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(X, y, stratify=y, test_size=0.25, random_state=42)

In [23]:
X.head()
#X_test.tail()

   latitude  longitude
0    -2.369     33.577
1    -2.532     32.948
2    -6.842     39.211
3    -6.779     39.241
4    -6.828     39.310

In [24]:
from sklearn.model_selection import cross_val_score

from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestClassifier
import lightgbm as lgb
import xgboost as xgb

logReg = LogisticRegression()
rfc = RandomForestClassifier()
lgbm = lgb.LGBMClassifier()
xgbt = xgb.XGBClassifier()

In [25]:
logReg.fit(X_train, y_train)
logReg_pred = logReg.predict(X_test)

(cross_val_score(logReg, X_train, y_train, cv=5).mean())

0.7117469592335179

In [26]:
rfc.fit(X_train, y_train)
rfc_pred = rfc.predict(X_test)

(cross_val_score(rfc, X_train, y_train, cv=5).mean())

0.9883254860057443

In [27]:
lgbm.fit(X_train, y_train)
lgbm_pred = lgbm.predict(X_test)

(cross_val_score(lgbm, X_train, y_train, cv=5).mean())

0.9867502460277466

In [28]:
xgbt.fit(X_train, y_train)
xgbt_pred = xgbt.predict(X_test)

#(cross_val_score(xgbt, X_train, y_train, cv=5).mean())

In [29]:
xgbt.fit(X, y)

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
       colsample_bynode=1, colsample_bytree=1, gamma=0, learning_rate=0.1,
       max_delta_step=0, max_depth=3, min_child_weight=1, missing=None,
       n_estimators=100, n_jobs=1, nthread=None,
       objective='multi:softprob', random_state=0, reg_alpha=0,
       reg_lambda=1, scale_pos_weight=1, seed=None, silent=None,
       subsample=1, verbosity=1)

In [30]:
train_data = pd.read_csv('training.csv', encoding = "ISO-8859-1")
test_data = pd.read_csv('test.csv', encoding = "ISO-8859-1")

In [31]:
train_data.head(4)

,ID,Q1,Q2,Q3,Q4,Q5,Q6,Q7,Q8_1,Q8_2,...,Q17,Q18,Q19,Latitude,Longitude,mobile_money,savings,borrowing,insurance,mobile_money_classification
0,5086,98,2,3,1,1,2,2,0,0,...,-1,4,4,-4.460,29.811,0,0,0,0,0
1,1258,40,1,1,3,5,1,1,1,0,...,4,1,4,-6.176,39.245,1,1,1,0,3
2,331,18,2,4,6,3,2,1,0,0,...,-1,1,1,-6.826,37.653,1,0,0,0,2
3,6729,50,1,1,3,1,1,1,0,0,...,-1,1,4,-3.372,35.808,1,0,1,0,3

In [32]:
test_data.tail(4)

,ID,Q1,Q2,Q3,Q4,Q5,Q6,Q7,Q8_1,Q8_2,...,Q12,Q13,Q14,Q15,Q16,Q17,Q18,Q19,Latitude,Longitude
2361,5651,50,2,1,3,1,2,2,0,0,...,2,-1,2,-1,1,-1,4,4,-3.410,31.510
2362,6463,49,1,1,2,1,1,1,0,1,...,2,-1,2,-1,1,-1,1,4,-3.372,33.911
2363,1508,28,2,1,3,5,2,1,0,1,...,2,-1,2,-1,1,-1,4,4,-1.682,33.707
2364,8385,70,2,3,1,1,1,2,0,0,...,2,-1,2,-1,1,-1,4,4,-2.457,33.637

In [33]:
train = train_data[['Latitude', 'Longitude']].rename(columns={'Latitude' : 'latitude', 'Longitude' : 'longitude'})
test = test_data[['Latitude', 'Longitude']].rename(columns={'Latitude' : 'latitude', 'Longitude' : 'longitude'})

#train.head(3)

In [34]:
train_region = xgbt.predict(train)
test_region = xgbt.predict(test)

In [35]:
train_region

array([ 5, 21, 11, ..., 15, 11, 20], dtype=int8)

In [36]:
test_region

array([13,  9,  4, ..., 17,  9, 13], dtype=int8)

In [37]:
mapping_dict = dict(zip(name_vs_label['region_label'], name_vs_label['region_name']))
mapping_dict

{13: 'Mwanza',
 1: 'Dar es Salaam',
 0: 'Arusha',
 14: 'Pwani',
 19: 'Tabora',
 7: 'Lindi',
 18: 'Singida',
 6: 'Kilimanjaro',
 2: 'Dodoma',
 11: 'Morogoro',
 3: 'Iringa',
 8: 'Manyara',
 12: 'Mtwara',
 20: 'Tanga',
 10: 'Mbeya',
 5: 'Kigoma',
 17: 'Shinyanga',
 9: 'Mara',
 16: 'Ruvuma',
 4: 'Kagera',
 21: 'Zanzibar',
 15: 'Rukwa'}

In [38]:
train_region = pd.DataFrame(train_region, columns=['region'])
test_region = pd.DataFrame(test_region, columns=['region'])

train_region = train_region['region'].map(mapping_dict).to_frame()
test_region = test_region['region'].map(mapping_dict).to_frame()

In [39]:
train_region.head()

     region
0    Kigoma
1  Zanzibar
2  Morogoro
3    Arusha
4     Rukwa

In [40]:
train_region.to_csv('trainRegion.csv', index=False)
test_region.to_csv('testRegion.csv', index=False)

GET THE DISTRICT OF THE LONGITUDE & LATITUDE OF THE TRAINING SET AND TEST SET

In [41]:
fsdt['district'] = fsdt['district'].astype('category')

In [42]:
cat_column = fsdt.select_dtypes(include='category')

fsdt['district'] = cat_column.apply(lambda x: x.cat.codes)
fsdt.head()

   region  district         ward  latitude  longitude
0      13        53     Nyanguge    -2.369     33.577
1      13        21      Nyakato    -2.532     32.948
2       1        19      Segerea    -6.842     39.211
3       1        38  Kijitonyama    -6.779     39.241
4       1       118    Kigamboni    -6.828     39.310

In [43]:
district_with_label = pd.concat([original_fsdt['district'], fsdt['district']], axis=1)

district_with_label.columns = ['district_name', 'district_label']

In [44]:
district_with_label.sample(3)

      district_name  district_label
26736         Ilala              19
27036  Iringa Urban              24
19098   Moshi Rural              71

In [45]:
y = fsdt['district']
X = fsdt[['latitude', 'longitude']]

X_train, X_test, y_train, y_test = train_test_split(X, y, stratify=y, test_size=0.2, random_state=42)

In [46]:
#xgbt.fit(X_train, y_train)
#xgbt_pred = xgbt.predict(X_test)
#(cross_val_score(xgbt, X_train, y_train, cv=5).mean())

In [47]:
xgbt.fit(X, y)

XGBClassifier(base_score=0.5, booster='gbtree', colsample_bylevel=1,
       colsample_bynode=1, colsample_bytree=1, gamma=0, learning_rate=0.1,
       max_delta_step=0, max_depth=3, min_child_weight=1, missing=None,
       n_estimators=100, n_jobs=1, nthread=None,
       objective='multi:softprob', random_state=0, reg_alpha=0,
       reg_lambda=1, scale_pos_weight=1, seed=None, silent=None,
       subsample=1, verbosity=1)

In [48]:
train_district = xgbt.predict(train)
test_district = xgbt.predict(test)

In [49]:
mapping_dict = dict(zip(district_with_label['district_label'], district_with_label['district_name']))
mapping_dict

{53: 'Magu',
 21: 'Ilemela',
 19: 'Ilala',
 38: 'Kinondoni',
 118: 'Temeke',
 1: 'Arusha',
 3: 'Bagamoyo',
 93: 'Nzega',
 37: 'Kilwa',
 84: 'Nachingwea',
 48: 'Lindi Urban',
 114: 'Tabora Urban',
 109: 'Singida Urban',
 15: 'Hai',
 13: 'Dodoma Urban',
 36: 'Kilosa',
 24: 'Iringa Urban',
 41: 'Kiteto',
 92: 'Nyamagana',
 35: 'Kilombero',
 70: 'Morogoro Urban',
 72: 'Moshi Urban',
 76: 'Mtwara Urban',
 18: 'Igunga',
 105: 'Siha',
 29: 'Kibaha',
 44: 'Korogwe',
 45: 'Kwimba',
 95: 'Rombo',
 12: 'Dodoma Rural',
 122: 'Uyui',
 60: 'Mbeya Urban',
 90: 'Njombe',
 67: 'Mkuranga',
 83: 'Mwanga',
 62: 'Mbozi',
 20: 'Ileje',
 32: 'Kigoma Urban',
 116: 'Tanga',
 25: 'Kahama',
 71: 'Moshi Rural',
 49: 'Liwale',
 81: 'Musoma Urban',
 102: 'Serengeti',
 4: 'Bariadi',
 111: 'Songea Urban',
 74: 'Mpwapwa',
 31: 'Kigoma Rural',
 0: 'Arumeru',
 103: 'Shinyanga Rural',
 50: 'Ludewa',
 28: 'Kasulu',
 7: 'Bukoba Urban',
 39: 'Kisarawe',
 117: 'Tarime',
 51: 'Lushoto',
 33: 'Kilindi',
 100: 'Same',
 27: 'Karatu',
 22: 'Iramba',
 66: 'Misungwi',
 30: 'Kibondo',
 47: 'Lindi Rural',
 61: 'Mbinga',
 17: 'Handeni',
 87: 'Newala',
 8: 'Bukombe',
 40: 'Kishapu',
 2: 'Babati',
 82: 'Mvomero',
 115: 'Tandahimba',
 104: 'Shinyanga Urban',
 34: 'Kilolo',
 101: 'Sengerema',
 42: 'Kondoa',
 23: 'Iringa Rural',
 121: 'Urambo',
 106: 'Sikonge',
 96: 'Rorya',
 9: 'Bunda',
 55: 'Manyoni',
 68: 'Monduli',
 69: 'Morogoro Rural',
 59: 'Mbeya Rural',
 77: 'Mufindi',
 75: 'Mtwara Rural',
 16: 'Hanang',
 54: 'Makete',
 94: 'Pangani',
 98: 'Rufiji',
 64: 'Meatu',
 56: 'Masasi',
 57: 'Maswa',
 46: 'Kyela',
 63: 'Mbulu',
 97: 'Ruangwa',
 43: 'Kongwa',
 78: 'Muheza',
 26: 'Karagwe',
 123: 'Zanzibar',
 5: 'Biharamulo',
 58: 'Mbarali',
 79: 'Muleba',
 14: 'Geita',
 10: 'Chato',
 65: 'Misenyi',
 99: 'Rungwe',
 113: 'Sumbawanga Urban',
 73: 'Mpanda',
 11: 'Chunya',
 91: 'Nkansi',
 6: 'Bukoba Rural',
 110: 'Songea Rural',
 88: 'Ngara',
 52: 'Mafia',
 107: 'Simanjiro',
 89: 'Ngorongoro',
 108: 'Singida Rural',
 119: 'Tunduru',
 85: 'Namtumbo',
 120: 'Ulanga',
 112: 'Sumbawanga Rural',
 86: 'Nanyumbu',
 80: 'Musoma Rural'}

In [50]:
train_district = pd.DataFrame(train_district, columns=['district'])
test_district = pd.DataFrame(test_district, columns=['district'])

train_district = train_district['district'].map(mapping_dict).to_frame()
test_district = test_district['district'].map(mapping_dict).to_frame()

In [51]:
#train_district

In [52]:
train_district.to_csv('trainDistrict.csv', index=False)
test_district.to_csv('testDistrict.csv', index=False)

In [53]:
original_fsdt.head()

          region   district         ward  latitude  longitude
0         Mwanza       Magu     Nyanguge    -2.369     33.577
1         Mwanza    Ilemela      Nyakato    -2.532     32.948
2  Dar es Salaam      Ilala      Segerea    -6.842     39.211
3  Dar es Salaam  Kinondoni  Kijitonyama    -6.779     39.241
4  Dar es Salaam     Temeke    Kigamboni    -6.828     39.310

In [54]:
get_long_lat = original_fsdt[['district', 'latitude', 'longitude']]

In [55]:
get_long_lat.head()

    district  latitude  longitude
0       Magu    -2.369     33.577
1    Ilemela    -2.532     32.948
2      Ilala    -6.842     39.211
3  Kinondoni    -6.779     39.241
4     Temeke    -6.828     39.310

In [56]:
get_long_lat[get_long_lat['district']=='Magu'].sample(5)

      district  latitude  longitude
24118     Magu    -2.245     33.850
32182     Magu    -2.517     32.899
44528     Magu    -2.592     33.444
12518     Magu    -2.555     33.043
25122     Magu    -2.524     32.913

In [57]:
get_long_lat[get_long_lat['district']=='Ilemela'].sample(5)

      district  latitude  longitude
8778   Ilemela    -2.545     32.983
38663  Ilemela    -2.537     32.977
41767  Ilemela    -2.454     32.912
42555  Ilemela    -2.504     32.898
44120  Ilemela    -2.545     32.980

In [58]:
get_long_lat[get_long_lat['district']=='Ilala'].sample(5)

      district  latitude  longitude
39030    Ilala    -6.859     39.237
6429     Ilala    -6.839     39.240
50302    Ilala    -6.903     39.201
3179     Ilala    -6.881     39.157
54392    Ilala    -6.817     39.280

In [59]:
train_district = pd.read_csv('trainDistrict.csv')
test_district = pd.read_csv('testDistrict.csv')

In [69]:
train_district.head(7)

         district
0          Kasulu
1        Zanzibar
2  Morogoro Urban
3          Karatu
4          Nkansi
5          Kilosa
6       Kilombero

In [61]:
get_long_lat.drop_duplicates(subset='district', keep='first', inplace=True)
get_long_lat.reset_index(drop=True, inplace=True)

In [62]:
get_long_lat.shape

(124, 3)

In [63]:
train_district_long_lat = pd.merge(train_district, get_long_lat, on='district', how='left')
test_district_long_lat = pd.merge(test_district, get_long_lat, on='district', how='left')

In [64]:
train_district_long_lat.to_csv('trainDistrictLongLat.csv', index=False)
test_district_long_lat.to_csv('testDistrictLongLat.csv', index=False)